# Напишите программу, которая найдёт 
# произведение пар чисел списка. 
# Парой считаем первый и последний элемент, 
# второй и предпоследний и т.д.

# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

lst1 = [2, 3, 4, 5, 6]
lst2 = []
for i in range((len(lst1)+1) // 2):
    lst2.append(lst1[i]*lst1[len(lst1)-1-i])
      
print(lst2)
